---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.ReverseIterator
source: html/381419ed-a21b-0698-b485-ef1eeb8e3865.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.